---
layout: post
status: publish
published: true
title: Advent of Code 2016 dzień 24
author:
  display_name: Marcin Pietraszek
  login: marcin
  email: m.pietraszek@gmail.com
  url: ''
author_login: marcin
author_email: m.pietraszek@gmail.com
excerpt: "Advent of Code 2016 dzień 24. Musisz znaleźć najkr&oacute;tszą drogę dla
  robota czyszczącego kanały wentylacyjne. Robot musi odwiedzić kilka miejsc w plątaninie
  kanał&oacute;w.\r\n\r\n"
wordpress_id: 716
wordpress_url: http://www.samouczekprogramisty.pl/?p=716
date: '2016-12-26 08:23:00 +0100'
date_gmt: '2016-12-26 07:23:00 +0100'
categories:
- Strefa zadaniowa
tags: []
comments: []
---
<p>Advent of Code 2016 dzień 24. Musisz znaleźć najkr&oacute;tszą drogę dla robota czyszczącego kanały wentylacyjne. Robot musi odwiedzić kilka miejsc w plątaninie kanał&oacute;w.</p>
<p><a id="more"></a><a id="more-716"></a></p>
<h1>Wprowadzenie<&#47;h1><br />
[idea]Oryginalna strona z zadaniami z <a href="http:&#47;&#47;adventofcode.com&#47;2016" target="_blank">Advent of Code 2016<&#47;a>. Zadanie z artykułu dostępne jest pod adresem <a href="http:&#47;&#47;adventofcode.com&#47;2016&#47;day&#47;24" target="_blank">http:&#47;&#47;adventofcode.com&#47;2016&#47;day&#47;24<&#47;a>[&#47;idea]</p>
<p>Advent of Code to inicjatywa, w kt&oacute;rej codziennie publikowane są zadania algorytmiczne dla programist&oacute;w. Ich rozwiązywanie pomaga rozwijać umiejętności nie tyko początkujących programist&oacute;w. W tej serii artykuł&oacute;w pokazuję zadanie opublikowane w ramach Advent of Code 2016 wraz z przykładowym rozwiązaniem.</p>
<p>[idea]Jeśli masz ochotę na odrobinę rywalizacji możesz dołączyć do klasyfikacji, kt&oacute;rą założyłem na oryginalnej stronie. Aby dołączyć do tej klasyfikacji zaloguj się na <a href="http:&#47;&#47;adventofcode.com&#47;2016" target="_blank">http:&#47;&#47;adventofcode.com&#47;2016<&#47;a> i dołącz wpisując kod <code>124245-88569bd0<&#47;code>.[&#47;idea]</p>
<h1>Dzień 24 zadanie 1<&#47;h1><br />
W końcu udało Ci się przezwyciężyć <a href="http:&#47;&#47;www.samouczekprogramisty.pl&#47;advent-of-code-2016-dzien-23&#47;">klawiaturę z sejfu<&#47;a>. Dzięki dokumentom, kt&oacute;re tam znalazłeś dotarłeś do drzwi prowadzących na dach. Niestety są zamknięte na głucho, nie możesz się nawet to nich dostać, widzisz je za szybą kuloodporną. Jednak, robot, kt&oacute;ry czyści kanały wentylacyjne może.</p>
<p>Niestety nie jest to szybki robot, możesz go przekonfigurować tak, że będzie m&oacute;gł połączyć się z kablami prowadzonymi z sytemu <a href="https:&#47;&#47;en.wikipedia.org&#47;wiki&#47;HVAC" target="_blank">HVAC<&#47;a> (ogrzewanie, wentylacja, klimatyzacja). Jeśli będziesz w stanie pokierować go tak, żeby dotarł do kilku miejsc będziesz m&oacute;gł ominąć system bezpieczeństwa chroniący drzwi.</p>
<p>Udało Ci się zdobyć plany kanał&oacute;w wentylacyjnych, na kt&oacute;rych zaznaczone są istotne miejsca na mapie (wejście do programu). <code>0<&#47;code> to Twoja aktualna pozycja, z kt&oacute;rej robot czyszczący zaczyna się poruszać. Pozostałe numery (kolejność nie ma znaczenia) oznaczają miejsca, kt&oacute;re robot musi odwiedzić co najmniej raz. Mury oznaczone są <code>#<&#47;code> a kanały, po kt&oacute;rych może się poruszać robot <code>.<&#47;code>. Numery oznaczające miejsca to także miejsca dostępne dla robota.</p>
<p>Na przykład, zakładając, że mapa kanał&oacute;w wentylacyjnych wygląda następująco:</p>
<pre class="lang:default highlight:0 decode:true ">###########<br />
#0.1.....2#<br />
#.#######.#<br />
#4.......3#<br />
###########<&#47;pre><br />
Aby dotrzeć do wszystkich istotnych miejsc tak szybko jak to możliwe robot wybrał następującą ścieżkę:</p>
<ul>
<li>od miejsca startowego do <code>4<&#47;code> (2 kroki),<&#47;li>
<li>od miejsca <code>4<&#47;code> do <code>1<&#47;code> (4 kroki, robot nie może poruszać się na ukos),<&#47;li>
<li>od miejsca <code>1<&#47;code> do miejsca <code>2<&#47;code> (6 krok&oacute;w),<&#47;li>
<li>od miejsca <code>2<&#47;code> do miejsca <code>3<&#47;code> (2 kroki).<&#47;li><br />
<&#47;ul><br />
Z racji tego, że robot jest raczej powolny musisz znaleźć najkr&oacute;tszą drogę. Przykład pokazuje najkr&oacute;tszą możliwą drogę (14 krok&oacute;w) wymaganych do odwiedzenia wszystkich istotnych punkt&oacute;w co najmniej raz.</p>
<p>Zakładając, że mapa kanał&oacute;w wentylacyjnych znajduje się w <a href="https:&#47;&#47;raw.githubusercontent.com&#47;SamouczekProgramisty&#47;StrefaZadaniowaSamouka&#47;master&#47;05_aoc_2016&#47;src&#47;main&#47;test&#47;resources&#47;day24_input.txt">tym pliku<&#47;a> i że robot zaczyna z pozycji <code>0<&#47;code>, jaka jest najmniejsza liczba krok&oacute;w potrzebna aby odwiedzić wszystkie miejsca oznaczone numerami co najmniej raz?</p>
<h1>Podsumowanie<&#47;h1><br />
Zachęcam do dalszej zabawy z drugim zadaniem, jego treść pokaże się na stronie AoC2016 po rozwiązaniu pierwszego. Takie zadania pomagają w rozwijaniu umiejętności nie tylko początkujących programist&oacute;w. Jeśli będziesz miał jakikolwiek problem z rozwiązaniem zadania możesz rzucić okiem do <a href="https:&#47;&#47;github.com&#47;SamouczekProgramisty&#47;StrefaZadaniowaSamouka&#47;tree&#47;master&#47;05_aoc_2016&#47;src&#47;main&#47;java&#47;pl&#47;samouczekprogramisty&#47;szs&#47;aoc2016&#47;day24" target="_blank">przykładowego rozwiązania<&#47;a>, jednak zr&oacute;b to raczej w ostateczności.</p>
<p>Na koniec mam do Ciebie prośbę - podziel się linkiem do artykułu ze znajomymi, może Oni także będą chcieli pom&oacute;c Świętemu Mikołajowi ;) ? Jeśli nie chcesz ominąć kolejnych artykuł&oacute;w proszę zapisz się do mojego newslettera i polub stronę na facebooku. Do następnego razu!</p>
<p>[FM_form id="3"]</p>
<p>Zdjęcie dzięki uprzejmości https:&#47;&#47;www.flickr.com&#47;photos&#47;derekl&#47;sets&#47;72157649148835567</p>
