---
layout: post
status: publish
published: true
title: Advent of Code 2016 dzień 20
author:
  display_name: Marcin Pietraszek
  login: marcin
  email: m.pietraszek@gmail.com
  url: ''
author_login: marcin
author_email: m.pietraszek@gmail.com
excerpt: "Advent of Code 2016 dzień 20. Potrzebna jest Twoja pomoc przy odnalezieniu
  pierwszego adresu IP, kt&oacute;ry nie jest zablokowany przez firewall. Pomożesz?\r\n\r\n"
wordpress_id: 698
wordpress_url: http://www.samouczekprogramisty.pl/?p=698
date: '2016-12-22 21:44:35 +0100'
date_gmt: '2016-12-22 20:44:35 +0100'
categories:
- Strefa zadaniowa
tags: []
comments: []
---
<p>Advent of Code 2016 dzień 20. Potrzebna jest Twoja pomoc przy odnalezieniu pierwszego adresu IP, kt&oacute;ry nie jest zablokowany przez firewall. Pomożesz?</p>
<p><a id="more"></a><a id="more-698"></a></p>
<h1>Wprowadzenie<&#47;h1><br />
[idea]Oryginalna strona z zadaniami z <a href="http:&#47;&#47;adventofcode.com&#47;2016" target="_blank">Advent of Code 2016<&#47;a>. Zadanie z artykułu dostępne jest pod adresem <a href="http:&#47;&#47;adventofcode.com&#47;2016&#47;day&#47;20" target="_blank">http:&#47;&#47;adventofcode.com&#47;2016&#47;day&#47;20<&#47;a>[&#47;idea]</p>
<p>Advent of Code to inicjatywa, w kt&oacute;rej codziennie publikowane są zadania algorytmiczne dla programist&oacute;w. Ich rozwiązywanie pomaga rozwijać umiejętności nie tyko początkujących programist&oacute;w. W tej serii artykuł&oacute;w pokazuję zadanie opublikowane w ramach Advent of Code 2016 wraz z przykładowym rozwiązaniem.</p>
<p>[idea]Jeśli masz ochotę na odrobinę rywalizacji możesz dołączyć do klasyfikacji, kt&oacute;rą założyłem na oryginalnej stronie. Aby dołączyć do tej klasyfikacji zaloguj się na <a href="http:&#47;&#47;adventofcode.com&#47;2016" target="_blank">http:&#47;&#47;adventofcode.com&#47;2016<&#47;a> i dołącz wpisując kod <code>124245-88569bd0<&#47;code>.[&#47;idea]</p>
<h1>Dzień 20 zadanie 1<&#47;h1><br />
Dzięki Tobie wczoraj udało się <a href="http:&#47;&#47;www.samouczekprogramisty.pl&#47;advent-of-code-2016-dzien-19&#47;">znaleźć Elfa<&#47;a>, kt&oacute;ry ma wszystkie prezenty. Dzisiaj chciałbyś wpiąć do sieci sw&oacute;j mały mikroprocesor żeby mieć dostęp do sieci p&oacute;źniej. Jednak firewall w Kwaterze Gł&oacute;wnej pozwala tylko na komunikację z kilkoma zewnętrznymi adresami IP.</p>
<p>Udało Ci się dostać do listy blokowanych adres&oacute;w IP, jednak lista jest strasznie słabo utrzymana. Wszystkie IP są pomieszane i nie jest jasne kt&oacute;re adresy IP są dozwolone. Ponadto, adresy nie są zapisane w standardowej notacji a jako zwykłe liczby całkowite, kt&oacute;re mogą mieć wartość od 0 do 4294967295 włącznie.</p>
<p>Na przykład, zał&oacute;żmy, że tylko wartości od 0 do 9 były poprawne i udało Ci się wyciągnąć następującą listę zablokowanych adres&oacute;w:</p>
<pre class="lang:default highlight:0 decode:true ">5-8<br />
0-2<br />
4-7<&#47;pre><br />
Lista określa zakresy adres&oacute;w IP, zar&oacute;wno startowa jak i końcowa wartość są zabronione. W takim przypadku wyłącznie adresy IP 3 i 9 są dozwolone, jako jedyne nie są w żadnym z zablokowanych zakres&oacute;w.</p>
<p>Zakładając, że lista zablokowanych adres&oacute;w znajduje się w <a href="https:&#47;&#47;raw.githubusercontent.com&#47;SamouczekProgramisty&#47;StrefaZadaniowaSamouka&#47;master&#47;05_aoc_2016&#47;src&#47;main&#47;test&#47;resources&#47;day20_input.txt" target="_blank">tym pliku<&#47;a>, jaka jest najniższa wartość IP, kt&oacute;ry nie jest zablokowany?</p>
<h1>Podsumowanie<&#47;h1><br />
Zachęcam do dalszej zabawy z drugim zadaniem, jego treść pokaże się na stronie AoC2016 po rozwiązaniu pierwszego. Takie zadania pomagają w rozwijaniu umiejętności nie tylko początkujących programist&oacute;w. Jeśli będziesz miał jakikolwiek problem z rozwiązaniem zadania możesz rzucić okiem do <a href="https:&#47;&#47;github.com&#47;SamouczekProgramisty&#47;StrefaZadaniowaSamouka&#47;tree&#47;master&#47;05_aoc_2016&#47;src&#47;main&#47;java&#47;pl&#47;samouczekprogramisty&#47;szs&#47;aoc2016&#47;day20" target="_blank">przykładowego rozwiązania<&#47;a>, jednak zr&oacute;b to raczej w ostateczności.</p>
<p>Na koniec mam do Ciebie prośbę - podziel się linkiem do artykułu ze znajomymi, może Oni także będą chcieli pom&oacute;c Świętemu Mikołajowi ;) ? Jeśli nie chcesz ominąć kolejnych artykuł&oacute;w proszę zapisz się do mojego newslettera i polub stronę na facebooku. Do następnego razu!</p>
<p>[FM_form id="3"]</p>
<p>Zdjęcie dzięki uprzejmości https:&#47;&#47;www.flickr.com&#47;photos&#47;derekl&#47;sets&#47;72157649148835567</p>
