---
layout: post
status: publish
published: true
title: Advent of Code 2016 dzień 6
author:
  display_name: Marcin Pietraszek
  login: marcin
  email: m.pietraszek@gmail.com
  url: ''
author_login: marcin
author_email: m.pietraszek@gmail.com
excerpt: Advent of Code 2016 dzień 6. Dzisiaj pr&oacute;bujemy skontaktować się ze
  Świętym Mikołajem. Kod z powt&oacute;rzeniami może pom&oacute;c odszyfrować zakł&oacute;coną
  transmisję.
wordpress_id: 611
wordpress_url: http://www.samouczekprogramisty.pl/?p=611
date: '2016-12-08 18:11:52 +0100'
date_gmt: '2016-12-08 17:11:52 +0100'
categories:
- Strefa zadaniowa
tags: []
comments: []
---
<p>Advent of Code 2016 dzień 6. Dzisiaj pr&oacute;bujemy skontaktować się ze Świętym Mikołajem. Kod z powt&oacute;rzeniami może pom&oacute;c odszyfrować zakł&oacute;coną transmisję.<a id="more"></a><a id="more-611"></a></p>
<h1>Wprowadzenie<&#47;h1><br />
[idea]Oryginalna strona z zadaniami z <a href="http:&#47;&#47;adventofcode.com&#47;2016" target="_blank">Advent of Code 2016<&#47;a>. Zadanie z artykułu dostępne jest pod adresem <a href="http:&#47;&#47;adventofcode.com&#47;2016&#47;day&#47;6" target="_blank">http:&#47;&#47;adventofcode.com&#47;2016&#47;day&#47;6<&#47;a>[&#47;idea]</p>
<p>Advent of Code to inicjatywa, w kt&oacute;rej codziennie publikowane są zadania algorytmiczne dla programist&oacute;w. Ich rozwiązywanie pomaga rozwijać umiejętności nie tyko początkujących programist&oacute;w. W tej serii artykuł&oacute;w pokazuję zadanie opublikowane w ramach Advent of Code 2016 wraz z przykładowym rozwiązaniem.</p>
<p>[idea]Jeśli masz ochotę na odrobinę rywalizacji możesz dołączyć do klasyfikacji, kt&oacute;rą założyłem na oryginalnej stronie. Aby dołączyć do tej klasyfikacji zaloguj się na <a href="http:&#47;&#47;adventofcode.com&#47;2016">http:&#47;&#47;adventofcode.com&#47;2016<&#47;a> i dołącz wpisując kod <code>124245-88569bd0<&#47;code>.[&#47;idea]</p>
<h1>Dzień 6 zadanie 1<&#47;h1><br />
Wczorajsze <a href="http:&#47;&#47;www.samouczekprogramisty.pl&#47;advent-of-code-2016-dzien-5&#47;">złamanie kodu do drzwi<&#47;a> pomogło Ci dostać się do odpowiedniego pokoju z prezentami. Dzisiaj pr&oacute;bujesz skontaktować się ze Świętym Mikołajem. Coś się jednak zacina. Na szczęście sygnał nie jest w pełni zakł&oacute;cony i instrukcja w sytuacjach jak ta zaleca przełączenie się do <a href="https:&#47;&#47;en.wikipedia.org&#47;wiki&#47;Repetition_code" target="_blank">kodu z powt&oacute;rzeniami<&#47;a> żeby przesłać wiadomość poprawnie.</p>
<p>W tym modelu wiadomość wysyłana jest kilkukrotnie. Zachowałeś wszystkie otrzymane do tej pory sygnały, jednak dane wydają się być dość mocno zakł&oacute;cone. Prawie niemożliwe do odzyskania. Prawie robi wielką r&oacute;żnicę :).</p>
<p>Jedyne co musisz zrobić to odnaleźć, kt&oacute;ra litera powtarza się największą liczbę razy na każdej pozycji. Na przykład, zakładając, że otrzymałeś następujące sygnały:</p>
<pre class="western">eedadn<br />
drvtee<br />
eandsr<br />
raavrd<br />
atevrs<br />
tsrnev<br />
sdttsa<br />
rasrtv<br />
nssdts<br />
ntnada<br />
svetve<br />
tesnvt<br />
vntsnd<br />
vrdear<br />
dvrsen<br />
enarar<&#47;pre><br />
Najczęściej pojawiającą się literą na pierwszej pozycji jest e, na drugiej a na trzeciej s i tak dalej. Łącząc te litery ze sobą otrzymasz prawdziwy sygnał bez zakł&oacute;ceń, easter.</p>
<p>Zakładając, że wszystkie przychodzące komunikaty zostały zapisane w <a href="https:&#47;&#47;raw.githubusercontent.com&#47;SamouczekProgramisty&#47;StrefaZadaniowaSamouka&#47;master&#47;05_aoc_2016&#47;src&#47;main&#47;test&#47;resources&#47;day06_input.txt" target="_blank">tym pliku<&#47;a>, jaka wiadomość (po oczyszczeniu zakł&oacute;ceń) była rzeczywiście wysłana?</p>
<h1>Podsumowanie<&#47;h1><br />
Zachęcam do dalszej zabawy z drugim zadaniem, jego treść pokaże się na stronie AoC2016 po rozwiązaniu pierwszego. Takie zadania pomagają w rozwijaniu umiejętności nie tylko początkujących programist&oacute;w. Jeśli będziesz miał jakikolwiek problem z rozwiązaniem zadania możesz rzucić okiem do <a href="https:&#47;&#47;github.com&#47;SamouczekProgramisty&#47;StrefaZadaniowaSamouka&#47;tree&#47;master&#47;05_aoc_2016&#47;src&#47;main&#47;java&#47;pl&#47;samouczekprogramisty&#47;szs&#47;aoc2016&#47;day06" target="_blank">przykładowego rozwiązania<&#47;a>, jednak zr&oacute;b to raczej w ostateczności.</p>
<p>Na koniec mam do Ciebie prośbę - podziel się linkiem do artykułu ze znajomymi, może Oni także będą chcieli pom&oacute;c Świętemu Mikołajowi ;) ? Jeśli nie chcesz ominąć kolejnych artykuł&oacute;w proszę zapisz się do mojego newslettera i polub stronę na facebooku. Do następnego razu!</p>
<p>[FM_form id="3"]</p>
<p>Zdjęcie dzięki uprzejmości https:&#47;&#47;www.flickr.com&#47;photos&#47;derekl&#47;sets&#47;72157649148835567</p>
