---
layout: post
status: publish
published: true
title: Advent of Code dzień 7
author:
  display_name: Marcin Pietraszek
  login: marcin
  email: m.pietraszek@gmail.com
  url: ''
author_login: marcin
author_email: m.pietraszek@gmail.com
excerpt: "Advent of Code 2016 dzień 7. Tym razem pr&oacute;bujesz podsłuchać ruch
  sieciowy w Kwaterze Gł&oacute;wnej Kr&oacute;liczka Wielkanocnego. Problem w tym,
  że używa się tam IPv7...\r\n\r\n"
wordpress_id: 622
wordpress_url: http://www.samouczekprogramisty.pl/?p=622
date: '2016-12-09 16:12:27 +0100'
date_gmt: '2016-12-09 15:12:27 +0100'
categories:
- Strefa zadaniowa
tags: []
comments: []
---
<p>Advent of Code 2016 dzień 7. Tym razem pr&oacute;bujesz podsłuchać ruch sieciowy w Kwaterze Gł&oacute;wnej Kr&oacute;liczka Wielkanocnego. Problem w tym, że używa się tam IPv7...</p>
<p><a id="more"></a><a id="more-622"></a></p>
<h1>Wprowadzenie<&#47;h1><br />
[idea]Oryginalna strona z zadaniami z <a href="http:&#47;&#47;adventofcode.com&#47;2016" target="_blank">Advent of Code 2016<&#47;a>. Zadanie z artykułu dostępne jest pod adresem <a href="http:&#47;&#47;adventofcode.com&#47;2016&#47;day&#47;7" target="_blank">http:&#47;&#47;adventofcode.com&#47;2016&#47;day&#47;7<&#47;a>[&#47;idea]</p>
<p>Advent of Code to inicjatywa, w kt&oacute;rej codziennie publikowane są zadania algorytmiczne dla programist&oacute;w. Ich rozwiązywanie pomaga rozwijać umiejętności nie tyko początkujących programist&oacute;w. W tej serii artykuł&oacute;w pokazuję zadanie opublikowane w ramach Advent of Code 2016 wraz z przykładowym rozwiązaniem.</p>
<p>[idea]Jeśli masz ochotę na odrobinę rywalizacji możesz dołączyć do klasyfikacji, kt&oacute;rą założyłem na oryginalnej stronie. Aby dołączyć do tej klasyfikacji zaloguj się na <a href="http:&#47;&#47;adventofcode.com&#47;2016" target="_blank">http:&#47;&#47;adventofcode.com&#47;2016<&#47;a> i dołącz wpisując kod <code>124245-88569bd0<&#47;code>.[&#47;idea]</p>
<h1>Dzień 7 zadanie 1<&#47;h1><br />
<a href="http:&#47;&#47;www.samouczekprogramisty.pl&#47;advent-of-code-2016-dzien-6&#47;">Wczoraj<&#47;a> odebrałeś tajny kod od Świętego Mikołaja. Dzisiaj nadszedł czas na inwigilację sieci w Kwaterze Gł&oacute;wnej Kr&oacute;liczka Wielkanocnego. W trakcie podsłuchiwania ruchu zebrałeś listę <a href="https:&#47;&#47;en.wikipedia.org&#47;wiki&#47;IP_address" target="_blank">adres&oacute;w IP<&#47;a> (oczywiście są to adresy IPv7[1. IPv7 w tym momencie nie istnieje.] , <a href="https:&#47;&#47;en.wikipedia.org&#47;wiki&#47;IPv6" target="_blank">IPv6<&#47;a> jest zbyt ograniczony...). Chciałbyś dowiedzieć się, kt&oacute;re z tych adres&oacute;w wspierają TLS.</p>
<p>Adres IPv7 wspiera TLS jeśli zawiera sekwencję ABBA wewnątrz standardowych części adresu IP. Sekwencja ABBA to czteroznakowa sekwencja, kt&oacute;re zawiera parę dw&oacute;ch r&oacute;żnych znak&oacute;w, po kt&oacute;rej znajduje się ta sama para ale odwr&oacute;cona. Na przykład <code>xyyx<&#47;code> czy <code>abba<&#47;code>. Jednak aby adres IPv7 wspierał TLS, sekwencja ABBA nie może znajdować się w żadnej części "hypernet" adresu IP. Części "hypernet" znajdują się między nawiasami <code>[]<&#47;code>.</p>
<p>Na przykład:</p>
<ul>
<li><code>abba[mnop]qrst<&#47;code> wspiera TLS, sekwencja ABBA <code>abba<&#47;code> znajduje się poza nawiasami <code>[]<&#47;code>,<&#47;li>
<li><code>abcd[bddb]xyyx<&#47;code> chociaż sekwencja ABBA <code>xyyx<&#47;code> jest poza nawiasami, adres ten nie wspiera TLS, sekwencja ABBA znajduje się także wewnątrz nawias&oacute;w <code>bddb<&#47;code>,<&#47;li>
<li><code>aaaa[qwer]tyui<&#47;code> nie wspiera TLS, <code>aaaa<&#47;code> nie jest poprawną sekwencją ABBA,<&#47;li>
<li><code>ioxxoj[asdfgh]zxcvbn<&#47;code> wspiera TLS, sekwencja ABBA <code>oxxo<&#47;code> znajduje się poza nawiasami (nie ma znaczenia to, że znajduje się wewnątrz dłuższego łańcucha).<&#47;li><br />
<&#47;ul><br />
Zakładając, że wszystkie adresy IP, kt&oacute;re udało Ci się podsłuchać znajdują się na <a href="https:&#47;&#47;raw.githubusercontent.com&#47;SamouczekProgramisty&#47;StrefaZadaniowaSamouka&#47;master&#47;05_aoc_2016&#47;src&#47;main&#47;test&#47;resources&#47;day07_input.txt" target="_blank">tej liście<&#47;a>, ile z nich wspiera TLS?</p>
<h1>Podsumowanie<&#47;h1><br />
Zachęcam do dalszej zabawy z drugim zadaniem, jego treść pokaże się na stronie AoC2016 po rozwiązaniu pierwszego. Takie zadania pomagają w rozwijaniu umiejętności nie tylko początkujących programist&oacute;w. Jeśli będziesz miał jakikolwiek problem z rozwiązaniem zadania możesz rzucić okiem do <a href="https:&#47;&#47;github.com&#47;SamouczekProgramisty&#47;StrefaZadaniowaSamouka&#47;tree&#47;master&#47;05_aoc_2016&#47;src&#47;main&#47;java&#47;pl&#47;samouczekprogramisty&#47;szs&#47;aoc2016&#47;day07" target="_blank">przykładowego rozwiązania<&#47;a>, jednak zr&oacute;b to raczej w ostateczności.</p>
<p>Na koniec mam do Ciebie prośbę - podziel się linkiem do artykułu ze znajomymi, może Oni także będą chcieli pom&oacute;c Świętemu Mikołajowi ;) ? Jeśli nie chcesz ominąć kolejnych artykuł&oacute;w proszę zapisz się do mojego newslettera i polub stronę na facebooku. Do następnego razu!</p>
<p>[FM_form id="3"]</p>
<p>Zdjęcie dzięki uprzejmości https:&#47;&#47;www.flickr.com&#47;photos&#47;derekl&#47;sets&#47;72157649148835567</p>
