---
layout: post
status: publish
published: true
title: Advent of Code 2016 dzień 1
author:
  display_name: Marcin Pietraszek
  login: marcin
  email: m.pietraszek@gmail.com
  url: ''
author_login: marcin
author_email: m.pietraszek@gmail.com
excerpt: "Advent of Code 2016 czas zacząć. Jest to pierwszy z serii artykuł&oacute;w,
  kt&oacute;re poświęcone będą zadaniom z AoC20016. Dzisiaj pomagamy Mikołajowi dotrzeć
  do Kwatery Gł&oacute;wnej Kr&oacute;liczka Wielkanocnego.\r\n\r\n"
wordpress_id: 578
wordpress_url: http://www.samouczekprogramisty.pl/?p=578
date: '2016-12-03 11:54:39 +0100'
date_gmt: '2016-12-03 10:54:39 +0100'
categories:
- Strefa zadaniowa
tags: []
comments: []
---
<p>Advent of Code 2016 czas zacząć. Jest to pierwszy z serii artykuł&oacute;w, kt&oacute;re poświęcone będą zadaniom z AoC20016. Dzisiaj pomagamy Mikołajowi dotrzeć do Kwatery Gł&oacute;wnej Kr&oacute;liczka Wielkanocnego.</p>
<p><a id="more"></a><a id="more-578"></a></p>
<p>[idea]Oryginalna strona z zadaniami z <a href="http:&#47;&#47;adventofcode.com&#47;2016" target="_blank">Advent of Code 2016<&#47;a>.[&#47;idea]</p>
<p>Zadania celowo publikuję z op&oacute;źnieniem, aby rozwiązania nie miały wpływu na zabawę innych. Dodatkowo każdego dnia na stronie Advent of Code publikowane są dwa zadania. Drugie dostępne jest po rozwiązaniu pierwszego. Przykładowe rozwiązanie zawiera oba rozwiązania jednak prezentuję treść tylko pierwszego z nich.</p>
<p>Mam nadzieję, że uda mi się rozwiązać wszystkie zadania, chociaż kto wie. Może jak pojawią się trudniejsze problemy algorytmiczne będę potrzebował pomocy? Zobaczymy :).</p>
<p>Oryginalna treść zadania dostępna jest pod adresem <a href="http:&#47;&#47;adventofcode.com&#47;2016&#47;day&#47;1" target="_blank">http:&#47;&#47;adventofcode.com&#47;2016&#47;day&#47;1<&#47;a>.</p>
<p>[idea]Jeśli masz ochotę na odrobinę rywalizacji możesz dołączyć do klasyfikacji, kt&oacute;rą założyłem na oryginalnej stronie. Aby dołączyć do tej klasyfikacji zaloguj się na <a href="http:&#47;&#47;adventofcode.com&#47;2016">http:&#47;&#47;adventofcode.com&#47;2016<&#47;a> i dołącz wpisując kod <code>124245-88569bd0<&#47;code>.[&#47;idea]</p>
<h1>Wprowadzenie<&#47;h1><br />
Sanie Świętego Mikołaja potrzebują zegara o bardzo wysokiej dokładności do wskazywania kierunku, oscylator zegara regulowany jest przez gwiazdy. Niestety, gwiazdy zostały ukradzione przez Kr&oacute;liczka Wielkanocnego. Aby ocalić Święta Wielki Mikołaj musi odzyskać wszystkie 50 gwiazdek do 25 grudnia.</p>
<p>Zbieraj gwiazdki rozwiązując zadania, każdego dnia udostępnione będą dwa zadania w kalendarzu adwentowym, drugie zadanie jest dostępne po ukończeniu pierwszego. Za rozwiązanie zadania otrzymujesz gwiazdkę. Powodzenia!</p>
<h1>Dzień 1 zadanie 1<&#47;h1><br />
Wylądowałeś niedaleko Kwatery Gł&oacute;wnej Kr&oacute;liczka Wielkanocnego. Niestety &bdquo;niedaleko&rdquo;, nie oznacza w Kwaterze Gł&oacute;wnej. Instrukcje na Dokumentach Rekrutacyjnych Kr&oacute;liczka Wielkanocnego pomagające w dotarcku do Kwater rozpracowały Elfy. Zaczynają się one od miejsca zrzutu, nikt nie miał czasu rozpracować ich do końca aby uzyskać dokładny adres Kwatery.</p>
<p>Dokumenty m&oacute;wią, że powinieneś rozpocząć swoją podr&oacute;ż do Kwatery w punkcie w kt&oacute;rym wylądowałeś i zwr&oacute;cić się na p&oacute;łnoc. Następnie powinieneś podążać zgodnie ze wskaz&oacute;wkami - skręcić w lewo (<code>L<&#47;code>) lub w prawo (<code>R<&#47;code>) o 90 stopni i iść prosto zadaną liczbę blok&oacute;w kończąc na nowym skrzyżowaniu.</p>
<p>Nie masz czasu na podążanie za tak absurdalnymi instrukcjami na pieszo, zanim ruszysz wolisz poznać dokładne wsp&oacute;łżędne celu. Zakładając, że możesz poruszać się wyłącznie <a href="https:&#47;&#47;en.wikipedia.org&#47;wiki&#47;Taxicab_geometry" target="_blank">ulicami miasta<&#47;a> jak długa jest najkr&oacute;tsza droga do celu?</p>
<p>Na przykład:</p>
<ul>
<li>Podążając za instrukcjami <code>R2, L3<&#47;code> kończysz 2 bloki na wsch&oacute;d i 3 bloki na p&oacute;łnoc, lub 5 blok&oacute;w od pozycji startowej,<&#47;li>
<li>podążając za <code>R2, R2, R2<&#47;code> kończysz 2 bloki na południe od pozycji startowej,<&#47;li>
<li>podążając za <code>R5, L5, R5, R3<&#47;code> kończysz 10 blok&oacute;w na wsch&oacute;d i 2 bloki na p&oacute;łnoc, lub 12 blok&oacute;w od pozycji startowej.<&#47;li><br />
<&#47;ul><br />
Jak daleko od pozycji lądowania znajduje się Kwatera Gł&oacute;wna Kr&oacute;liczka Wielkanocnego?</p>
<h1>Podsumowanie<&#47;h1><br />
Zachęcam do dalszej zabawy z drugim zadaniem, jego treść pokaże się na stronie AoC2016 po rozwiązaniu pierwszego. Takie zadania pomagają w rozwijaniu umiejętności nie tylko początkujących programist&oacute;w. Jeśli będziesz miał jakikolwiek problem z rozwiązaniem zadania możesz rzucić okiem do <a href="https:&#47;&#47;github.com&#47;SamouczekProgramisty&#47;StrefaZadaniowaSamouka&#47;tree&#47;master&#47;05_aoc_2016&#47;src&#47;main&#47;java&#47;pl&#47;samouczekprogramisty&#47;szs&#47;aoc2016&#47;day01" target="_blank">przykładowego rozwiązania<&#47;a>, jednak zr&oacute;b to raczej w ostateczności.</p>
<p>Na koniec mam do Ciebie prośbę - podziel się linkiem do artykułu ze znajomymi, może Oni także będą chcieli pom&oacute;c Świętemu Mikołajow ;) ? Jeśli nie chcesz ominąć kolejnych artykuł&oacute;w proszę zapisz się do mojego newslettera i polub stronę na facebooku. Do następnego razu!</p>
<p>[FM_form id="3"]</p>
<p>Zdjęcie dzięki uprzejmości https:&#47;&#47;www.flickr.com&#47;photos&#47;theslugandlettuce101&#47;8422854662&#47;sizes&#47;l.</p>
