---
layout: post
status: publish
published: true
title: Nagł&oacute;wki, sesje i ciasteczka
author:
  display_name: Marcin Pietraszek
  login: marcin
  email: m.pietraszek@gmail.com
  url: ''
author_login: marcin
author_email: m.pietraszek@gmail.com
excerpt: "W pierwszej części artykułu opisującej serwlety dowiedziałeś się podstaw
  dotyczących serwlet&oacute;w. W tym artykule będziesz m&oacute;gł poszerzyć tę wiedzę.
  Dowiesz się jakie możliwości dają klasy <code>HttpServletRequest<&#47;code> i <code>HttpServletResponse<&#47;code>.
  Wyjaśnię Ci czym jest sesja i jak pracować z <code>HttpSession<&#47;code>. Przeczytasz
  także o nagł&oacute;wkach i ciasteczkach, nauczysz się tworzyć je samodzielnie.
  Na końcu czeka także ćwiczenie, w kt&oacute;rym zastosujesz wiedzę w praktyce. Zapraszam
  do lektury.\r\n\r\n"
wordpress_id: 817
wordpress_url: http://www.samouczekprogramisty.pl/?p=817
date: '2017-04-01 15:57:24 +0200'
date_gmt: '2017-04-01 13:57:24 +0200'
categories:
- DSP2017
- Kurs aplikacji webowych
tags: []
---
<p>W pierwszej części artykułu opisującej serwlety dowiedziałeś się podstaw dotyczących serwlet&oacute;w. W tym artykule będziesz m&oacute;gł poszerzyć tę wiedzę. Dowiesz się jakie możliwości dają klasy <code>HttpServletRequest<&#47;code> i <code>HttpServletResponse<&#47;code>. Wyjaśnię Ci czym jest sesja i jak pracować z <code>HttpSession<&#47;code>. Przeczytasz także o nagł&oacute;wkach i ciasteczkach, nauczysz się tworzyć je samodzielnie. Na końcu czeka także ćwiczenie, w kt&oacute;rym zastosujesz wiedzę w praktyce. Zapraszam do lektury.</p>
<p><a id="more"></a><a id="more-817"></a></p>
<p>Zacznijmy od żądań i odpowiedzi. Wiesz już, o hierarchii dziedziczenia serwlet&oacute;w <code>Servlet<&#47;code>, <code>GenericServlet<&#47;code> i <code>HttpServlet<&#47;code>. W przypadku klasy opakowującej żądanie i odpowiedź sytuacja wygląda podobnie. Istnieją bazowe interfejsy <a href="https:&#47;&#47;docs.oracle.com&#47;javaee&#47;7&#47;api&#47;javax&#47;servlet&#47;ServletRequest.html" target="_blank"><code>ServeltRequest<&#47;code><&#47;a> i <a href="https:&#47;&#47;docs.oracle.com&#47;javaee&#47;7&#47;api&#47;javax&#47;servlet&#47;ServletResponse.html" target="_blank"><code>ServletResponse<&#47;code><&#47;a>.</p>
<p>W przypadku serwlet&oacute;w opartych o protok&oacute;ł HTTP interfejsy te są rozszerzane przez <a href="https:&#47;&#47;docs.oracle.com&#47;javaee&#47;7&#47;api&#47;javax&#47;servlet&#47;http&#47;HttpServletRequest.html" target="_blank"><code>HttpServletRequest<&#47;code><&#47;a> i <a href="https:&#47;&#47;docs.oracle.com&#47;javaee&#47;7&#47;api&#47;javax&#47;servlet&#47;http&#47;HttpServletResponse.html" target="_blank"><code>HttpServletResponse<&#47;code><&#47;a>. Rozszerzone interfejsy zawierają metody specyficzne dla protokołu HTTP.</p>
<p>Zauważ, że piszę tu wyłącznie o interfejsach. Są to interfejsy określone przez specyfikację serwlet&oacute;w. Kontener serwlet&oacute;w, kt&oacute;ry implementuję tę specyfikację dostarcza także konkretnych implementacji. To właśnie kontener odpowiedzialny jest za tworzenie instancji klas, kt&oacute;re implementują te interfejsy.</p>
<p>Z <a href="http:&#47;&#47;www.samouczekprogramisty.pl&#47;serwlety-w-aplikacjach-webowych&#47;">poprzedniego artykułu opisującego serwlety<&#47;a> wiesz już z jakich element&oacute;w składa się adres URL. Klasy opakowujące żądanie pozwalają na pracę z poszczeg&oacute;lnymi elementami adresu URL. Jedą z części tego adresu są parametry.</p>
<p>[warning]W artykule i przykładach używam bardzo prostego mechanizmu do generowania widok&oacute;w. Nie jest to spos&oacute;b "poprawny". To są jedynie przykłady, kt&oacute;re mają wprowadzić Cię w &ldquo;świat aplikacji webowych&rdquo;. W kolejnych artykułach poznasz lepszą metodę na generowanie stron HTML.[&#47;warning]</p>
<h1><code>HTTPServletRequest<&#47;code><&#47;h1></p>
<h2>Parametry URL<&#47;h2><br />
Jedną z części adresu URL są parametry. Są one dostępne po znaku <code>?<&#47;code>. Parametry zapisane są w formie klucz=wartość, z tym że jeden parametr może wystąpić wiele razy. Poszczeg&oacute;lne pary klucz=wartość rozdzielone są znakami <code>&amp;<&#47;code>.</p>
<p>W interfejsie <code>HttpServletRequest<&#47;code> istnieje kilka metod, kt&oacute;re pozwalają na pracę z parametrami. Proszę sp&oacute;jrz na przykład poniżej.</p>
<pre class="lang:default decode:true ">@WebServlet("&#47;parameters")<br />
public class ParametersServlet extends HttpServlet {<br />
    @Override<br />
    protected void doGet(HttpServletRequest req, HttpServletResponse resp) throws ServletException, IOException {<br />
        PrintWriter responseWriter = resp.getWriter();<br />
        responseWriter.write("<html><body>");<br />
        for (Map.Entry<String, String[]> entry : req.getParameterMap().entrySet()) {<br />
            responseWriter.write("
<p>" + entry.getKey() + ": " + Arrays.toString(entry.getValue()) +"<&#47;p>");<br />
        }<br />
        responseWriter.write("<&#47;body><&#47;html>");<br />
    }<br />
}<&#47;pre><br />
W przykładzie tym widzisz serwlet, kt&oacute;ry w odpowiedzi wypisuje wszystkie parametry z adresu URL żądania. Poza metodą <a href="https:&#47;&#47;docs.oracle.com&#47;javaee&#47;7&#47;api&#47;javax&#47;servlet&#47;ServletRequest.html#getParameterMap--" target="_blank"><code>getParameterMap<&#47;code><&#47;a> możesz użyć także kilku innych:</p>
<ul>
<li><a href="https:&#47;&#47;docs.oracle.com&#47;javaee&#47;7&#47;api&#47;javax&#47;servlet&#47;ServletRequest.html#getParameter-java.lang.String-" target="_blank"><code>getParameter()<&#47;code><&#47;a><&#47;li>
<li><a href="https:&#47;&#47;docs.oracle.com&#47;javaee&#47;7&#47;api&#47;javax&#47;servlet&#47;ServletRequest.html#getParameterNames--" target="_blank"><code>getParameterNames()<&#47;code><&#47;a><&#47;li>
<li><a href="https:&#47;&#47;docs.oracle.com&#47;javaee&#47;7&#47;api&#47;javax&#47;servlet&#47;ServletRequest.html#getParameterValues-java.lang.String-" target="_blank"><code>getParameterValues()<&#47;code><&#47;a><&#47;li><br />
<&#47;ul><br />
Po uruchomieniu aplikacji, kt&oacute;ra posiada taki serwlet i wpisaniu w przeglądarce adresu</p>
<pre class="lang:default highlight:0 decode:true ">http:&#47;&#47;localhost:8080&#47;02_serwlety&#47;parameters?parameter1=value1&amp;parameter2=value2&amp;parameter1=value11<&#47;pre><br />
Powinna wyświetlić się strona zawierająca dwie linijki:</p>
<pre class="lang:default highlight:0 decode:true ">parameter2: [value2]<br />
parameter1: [value1, value11]<&#47;pre></p>
<h3>Żądania POST a parametry<&#47;h3><br />
Powyżej opisałem sytuację, w kt&oacute;rej parametry przesyłane są jako fragment adresu URL żądania. Dzieje się tak w przypadku żądań typu GET. W przypadku wysyłania formularzy (zazwyczaj zapytania typu POST), parametry te przesyłane są w ciele żądania. Nie są one częścią adresu.</p>
<p>Mimo tego, że parametry przesyłane są w inny spos&oacute;b możesz z nimi pracować używając tego samego zestawu metod.</p>
<h2>Adres URL<&#47;h2><br />
Obiekt opakowujący żądanie pozwala także na pracę z adresem URL, kt&oacute;rego żądanie dotyczy. Zestaw metod pozwala na pobranie informacji na temat adresu żądania:</p>
<ul>
<li><a href="https:&#47;&#47;docs.oracle.com&#47;javaee&#47;7&#47;api&#47;javax&#47;servlet&#47;http&#47;HttpServletRequest.html#getContextPath--" target="_blank"><code>getContextPath()<&#47;code><&#47;a> zwraca fragment ścieżki, kt&oacute;ra jest &ldquo;podstawą&rdquo; wszystkich ścieżek obsługiwanych przez daną aplikację. W przypadku prostego instalowania aplikacji przy pomocy gradle będzie to nazwa pliku war,<&#47;li>
<li><a href="https:&#47;&#47;docs.oracle.com&#47;javaee&#47;7&#47;api&#47;javax&#47;servlet&#47;http&#47;HttpServletRequest.html#getServletPath--" target="_blank"><code>getServletPath()<&#47;code><&#47;a>&nbsp; zwraca fragment ścieżki, kt&oacute;ra została użyta w konfiguracji serwletu,<&#47;li>
<li><a href="https:&#47;&#47;docs.oracle.com&#47;javaee&#47;7&#47;api&#47;javax&#47;servlet&#47;http&#47;HttpServletRequest.html#getRequestURL--" target="_blank"><code>getRequestURL()<&#47;code><&#47;a>&nbsp; metoda zwraca adres URL żądania bez parametr&oacute;w zawartych w adresie,<&#47;li>
<li><a href="https:&#47;&#47;docs.oracle.com&#47;javaee&#47;7&#47;api&#47;javax&#47;servlet&#47;http&#47;HttpServletRequest.html#getRequestURI--" target="_blank"><code>getRequstURI()<&#47;code><&#47;a>&nbsp; zwraca adres URI (ang. <em>Uniform Resource Identifier<&#47;em>). Od aresu URL r&oacute;żni się on tym, że nie zawiera protokołu, serwera i portu.<&#47;li><br />
<&#47;ul><br />
Zakładając, że nasz sewlet obsługuje ścieżkę &#47;path w&oacute;wczas wywołanie powyższych metod po żądaniu</p>
<pre class="lang:default highlight:0 decode:true ">http:&#47;&#47;localhost:8080&#47;02_serwlety&#47;path?xxx=yyy zwr&oacute;ci następujące wartości<&#47;pre><br />
Powinno zwr&oacute;cić następujące wartości:</p>
<ul>
<li><code>getContextPath() &#47;02_serwlety<&#47;code><&#47;li>
<li><code>getServletPath() &#47;path<&#47;code><&#47;li>
<li><code>getRequestURI() &#47;02_serwlety&#47;path<&#47;code><&#47;li>
<li><code>getRequestURL() http:&#47;&#47;localhost:8080&#47;02_serwlety&#47;path<&#47;code><&#47;li><br />
<&#47;ul><br />
Przykładowy serwlet, kt&oacute;ry używa tych metod możesz znaleźć na <a href="https:&#47;&#47;github.com&#47;SamouczekProgramisty&#47;KursAplikacjeWebowe&#47;blob&#47;master&#47;02_serwlety&#47;src&#47;main&#47;java&#47;pl&#47;samouczekprogramisy&#47;kursaplikacjewebowe&#47;servlets&#47;PathServlet.java" target="_blank">samouczkowym githubie<&#47;a>.</p>
<h1><code>HttpServletResponse<&#47;code><&#47;h1><br />
Obiekt, implementujący ten interfejs także tworzony jest przez kontener serwlet&oacute;w. Służy on do przygotowania odpowiedzi na żądanie wysłane do serwera. W przypadku obiektu odpowiedzi musisz wiedzieć o następujących metodach</p>
<ul>
<li><a href="https:&#47;&#47;docs.oracle.com&#47;javaee&#47;7&#47;api&#47;javax&#47;servlet&#47;ServletResponse.html#getOutputStream--" target="_blank"><code>getOutputStream()<&#47;code><&#47;a> zwraca instancję <a href="https:&#47;&#47;docs.oracle.com&#47;javaee&#47;7&#47;api&#47;javax&#47;servlet&#47;ServletOutputStream.html" target="_blank"><code>ServletOutputStream<&#47;code><&#47;a>, kt&oacute;ra służy do tworzenia odpowiedzi zawierającej dane binarne,<&#47;li>
<li><a href="https:&#47;&#47;docs.oracle.com&#47;javaee&#47;7&#47;api&#47;javax&#47;servlet&#47;ServletResponse.html#getWriter--" target="_blank"><code>getWriter()<&#47;code><&#47;a>&nbsp;zwraca instancję <code>PrintWriter<&#47;code>, kt&oacute;ra służy do tworzenia odpowiedzi zawierającej tekst.<&#47;li><br />
<&#47;ul><br />
Ważne jest aby pamiętać, że w trakcie obsługi żądania możemy posługiwać się wyłącznie jedną z tych metod.</p>
<h1>Nagł&oacute;wki<&#47;h1><br />
Specyfikacja protokołu HTTP definiuje tak zwane nagł&oacute;wki. Nagł&oacute;wki dołączane są zar&oacute;wno do żądań jak i odpowiedzi. Nagł&oacute;wki to nic innego jak pary klucz-wartość, kt&oacute;re zapisane są w formacie <code>nazwa nagł&oacute;wka: treść nagł&oacute;wka<&#47;code>. Na przykład</p>
<pre class="lang:default highlight:0 decode:true">Content-Type: text&#47;html; charset=utf-8<br />
Content-Length: 13358<&#47;pre><br />
Przeglądarki internetowe posiadają wbudowane &ldquo;narzędzia developerskie&rdquo;, kt&oacute;re pozwalają na podejrzenie nagł&oacute;wk&oacute;w. Jeśli chcesz dowiedzieć się więcej o tych narzędziach zachęcam do odwiedzenia strony dedykowanej dla Twojej przeglądarki</p>
<ul>
<li><a href="https:&#47;&#47;developer.mozilla.org&#47;en-US&#47;docs&#47;Tools" target="_blank">Firefox<&#47;a><&#47;li>
<li><a href="https:&#47;&#47;developer.chrome.com&#47;devtools" target="_blank">Chrome <&#47;a><&#47;li>
<li><a href="http:&#47;&#47;www.opera.com&#47;dragonfly&#47;" target="_blank">Opera <&#47;a><&#47;li>
<li><a href="https:&#47;&#47;docs.microsoft.com&#47;en-us&#47;microsoft-edge&#47;f12-devtools-guide" target="_blank">Internet Explorer<&#47;a><&#47;li><br />
<&#47;ul><br />
<a href="http:&#47;&#47;www.samouczekprogramisty.pl&#47;wp-content&#47;uploads&#47;2017&#47;04&#47;headers.jpg"><img class="aligncenter size-medium wp-image-821" src="http:&#47;&#47;www.samouczekprogramisty.pl&#47;wp-content&#47;uploads&#47;2017&#47;04&#47;headers-300x178.jpg" alt="narzędzia developerskie nagł&oacute;wki" width="300" height="178" &#47;><&#47;a></p>
<p>Obiekty <code>HttpServletResponse<&#47;code> i <code>HttpServletRequest<&#47;code> pozwalają na pracę z nagł&oacute;wkami przy pomocy metod:</p>
<ul>
<li><a href="https:&#47;&#47;docs.oracle.com&#47;javaee&#47;7&#47;api&#47;javax&#47;servlet&#47;http&#47;HttpServletResponse.html#setHeader-java.lang.String-java.lang.String-" target="_blank"><code>setHeader()<&#47;code><&#47;a><&#47;li>
<li><a href="https:&#47;&#47;docs.oracle.com&#47;javaee&#47;7&#47;api&#47;javax&#47;servlet&#47;http&#47;HttpServletResponse.html#addHeader-java.lang.String-java.lang.String-" target="_blank"><code>addHeader()<&#47;code><&#47;a><&#47;li><br />
<&#47;ul><br />
Pierwsza z nich ustawia wartość nagł&oacute;wka, druga dodaje nową wartość nagł&oacute;wka (i tworzy go jeśli wcześniej nie był ustawiony). W rzeczywistości nagł&oacute;wek mający wiele wartości to dalej jedna para klucz-wartość. W tym przypadku wartość zawiera kilka element&oacute;w oddzielonych przecinkami.</p>
<p>Nagł&oacute;wki możesz pobierać z obiektu żądania używając metod:</p>
<ul>
<li><a href="https:&#47;&#47;docs.oracle.com&#47;javaee&#47;7&#47;api&#47;javax&#47;servlet&#47;http&#47;HttpServletRequest.html#getHeaderNames--" target="_blank"><code>getHeaderNames()<&#47;code><&#47;a><&#47;li>
<li><a href="https:&#47;&#47;docs.oracle.com&#47;javaee&#47;7&#47;api&#47;javax&#47;servlet&#47;http&#47;HttpServletResponse.html#getHeader-java.lang.String-" target="_blank"><code>getHeader()<&#47;code><&#47;a><&#47;li>
<li><a href="https:&#47;&#47;docs.oracle.com&#47;javaee&#47;7&#47;api&#47;javax&#47;servlet&#47;http&#47;HttpServletRequest.html#getHeaders-java.lang.String-" target="_blank"><code>getHeaders()<&#47;code><&#47;a><&#47;li><br />
<&#47;ul><br />
Poniższy serwlet używa tych metod aby ustawić kilka nagł&oacute;wk&oacute;w. W odpowiedzi na żadanie twoży stronę, kt&oacute;ra zawiera listę ustawionych nagł&oacute;wk&oacute;w. Jak zwykle mocno zachęcam do eksperymentowania, sam zobacz jak taki serwlet działa.</p>
<pre class="lang:default decode:true ">@Override<br />
protected void doGet(HttpServletRequest req, HttpServletResponse resp) throws ServletException, IOException {<br />
    PrintWriter responseWriter = resp.getWriter();</p>
<p>    responseWriter.write("<html><body>");<br />
    Enumeration<String> headerNames = req.getHeaderNames();<br />
    while (headerNames.hasMoreElements()) {<br />
        String headerName = headerNames.nextElement();<br />
        Enumeration<String> headerValues = req.getHeaders(headerName);<br />
        while (headerValues.hasMoreElements()) {<br />
            String headerValue = headerValues.nextElement();<br />
            responseWriter.write("
<p>" + headerName + ": " + headerValue + "<&#47;p>");<br />
        }<br />
    }</p>
<p>    resp.addHeader("my-custom-header", "value1");<br />
    resp.addHeader("my-custom-header", "value2");<br />
    resp.setIntHeader("my-custom-int-header", 123);</p>
<p>    responseWriter.write("<&#47;body><&#47;html>");<br />
}<&#47;pre></p>
<h2>Zastosowanie nagł&oacute;wk&oacute;w<&#47;h2><br />
Nagł&oacute;wki jako część protokołu HTTP pełnią bardzo istotną rolę. Dla przykładu poniżej pokazuję zestaw nagł&oacute;wk&oacute;w wysyłanych wraz z każdą odpowiedzią dla adresu www.samouczekprogramisty.pl:</p>
<pre class="lang:default highlight:0 decode:true">$ curl -I www.samouczekprogramisty.pl<br />
HTTP&#47;1.1 200 OK<br />
Set-Cookie: PHPSESSID=xxxxxxxxxxxxxxxxxxxxxx; path=&#47;<br />
Expires: Thu, 19 Nov 1981 08:52:00 GMT<br />
Cache-Control: no-store, no-cache, must-revalidate, post-check=0, pre-check=0<br />
Pragma: no-cache<br />
Content-Type: text&#47;html; charset=UTF-8<br />
Link: <http:&#47;&#47;www.samouczekprogramisty.pl&#47;wp-json&#47;>; rel="https:&#47;&#47;api.w.org&#47;"<br />
Date: Sun, 02 Apr 2017 10:46:08 GMT<br />
Accept-Ranges: bytes<br />
Server: LiteSpeed<br />
Connection: Keep-Alive<&#47;pre><br />
Użyłem do tego programu <code>curl<&#47;code>, kt&oacute;ry pozwala na wysyłanie żądań HTTP z linii poleceń. Fragment powyżej powoduje wysłanie żądania typu HEAD, kt&oacute;re zwraca wyłącznie nagł&oacute;wki (bez właściwej zawartości strony). Przykładowe zastosowanie nagł&oacute;wk&oacute;w:</p>
<ul>
<li>Pozwalają na ustawianie ciasteczek (przeczytasz o nich w kolejnym akapicie) (<code>Set-Cookie<&#47;code>),<&#47;li>
<li>Pozwalają na określenie zawartości strony. To dzięki nim przeglądarka wie jak interpretować odpowiedź, kt&oacute;rą dostanie. To nagł&oacute;wek określa czy w odpowiedzi znajduje się plik HTML (<code>Content-Type: text&#47;html; charset=UTF-8<&#47;code>). Czy może są dane binarne reprezentujące obrazek do wyświetlenia (<code>Content-Type: image&#47;jpeg<&#47;code>),<&#47;li>
<li>Mogą przyspieszyć ładowanie strony w przeglądarce. Jeśli odwiedziłeś już jakąś stronę to przeglądarka mogła zapisać część danych, kt&oacute;re wyświetliła (w tym część nagł&oacute;wk&oacute;w). Następnym razem nie wyśle żądania typu GET (aby pobrać całą zawartość) a jedynie HEAD (aby pobrać nagł&oacute;wki). Po sprawdzeniu nagł&oacute;wk&oacute;w stwierdzi, że dane się nie zmieniły i wyświetli poprzednio zapamiętaną zawartość (<code>Cache-Control: public, max-age=63115200<&#47;code>, <code>Last-Modified: Thu, 16 Mar 2017 17:12:14 GMT<&#47;code>).<&#47;li>
<li>Takie sprawdzenie może odbyć się też w inny spos&oacute;b. Przeglądarka może wysłać zapytanie typu GET dołączając odpowiednie nagł&oacute;wki. P&oacute;źniej żądanie z nagł&oacute;wkami interpretowane jest przez serwer. Jeśli serwer stwierdzi, że przeglądarka ma aktualną treść (potwierdza to nagł&oacute;wek), w&oacute;wczas wysyła odpowiedź informującą przeglądarkę, że jej kopia treści jest najnowsza. W takim przypadku zamiast przesyłać przez sieć obrazek o wielkości 400kB wysyła odpowiedź, kt&oacute;ra ma dużo mniej danych - kilka kilobajt&oacute;w (<code>ETag: "9db5f14aeaa00872"<&#47;code>,<&#47;li>
<li>Nagł&oacute;wki to metadane (dane o danych). Zdarza się, że są wykorzystywane do przesyłania dodatkowych informacji na temat danego żądania&#47;odpowiedzi.<&#47;li><br />
<&#47;ul><br />
Mimo tego, że nagł&oacute;wki są powszechnie stosowane w codziennej pracy z aplikacjami webowymi (szczeg&oacute;lnie na początku) nie są one "kluczowe". Większość z nich ustawiają za nas biblioteki zewnętrzne. Niemniej jednak dobrze jest wiedzieć o tym, że istnieją i do czego służą.</p>
<h1>Ciasteczka<&#47;h1><br />
Ciasteczka to mechanizm opisany w specyfikacji protokołu HTTP. W uproszczeniu można powiedzieć, że ciasteczka to informacje, kt&oacute;re dołączane są do żądania i mogą być ustawiane w odpowiedzi. Ciasteczka połączone są z adresem, pod kt&oacute;ry wysyłane jest żądanie. Przeglądarka internetowa wysyłając żądanie pod adres www.samouczekprogramisty.pl wyszukuje jakie ciasteczka ma zapisane dla tej domeny i dołącza je automatycznie do każdego żądania.</p>
<p><a href="http:&#47;&#47;www.samouczekprogramisty.pl&#47;wp-content&#47;uploads&#47;2017&#47;04&#47;ciasteczka-diagram.jpeg"><img class="aligncenter size-medium wp-image-822" src="http:&#47;&#47;www.samouczekprogramisty.pl&#47;wp-content&#47;uploads&#47;2017&#47;04&#47;ciasteczka-diagram-300x138.jpeg" alt="ciasteczka diagram" width="300" height="138" &#47;><&#47;a></p>
<p>Po stronie serwera, w odpowiedzi można ustawiać ciasteczka. Można to robić przy pomocy nagł&oacute;wka <code>Set-Cookie<&#47;code>. Z racji tego, że jest to bardzo popularny mechanizm istnieje osobny zestaw metod, kt&oacute;re pomagają pracować z ciasteczkami:</p>
<ul>
<li><a href="https:&#47;&#47;docs.oracle.com&#47;javaee&#47;7&#47;api&#47;javax&#47;servlet&#47;http&#47;HttpServletResponse.html#addCookie-javax.servlet.http.Cookie-" target="_blank"><code>addCookie()<&#47;code><&#47;a><&#47;li>
<li><a href="https:&#47;&#47;docs.oracle.com&#47;javaee&#47;7&#47;api&#47;javax&#47;servlet&#47;http&#47;HttpServletRequest.html#getCookies--" target="_blank"><code>getCookies()<&#47;code><&#47;a><&#47;li><br />
<&#47;ul><br />
Samo ciasteczko reprezentowane jest przez klasę <a href="https:&#47;&#47;docs.oracle.com&#47;javaee&#47;7&#47;api&#47;javax&#47;servlet&#47;http&#47;Cookie.html" target="_blank"><code>Cookie<&#47;code><&#47;a>. Podstawowymi atrybutami ciasteczka jest jego nazwa i wartość.</p>
<p>Dodatkowo możesz ustawić też inne atrybuty, takie jak czas życia ciasteczka. Jeśli jest on ustawiony, w&oacute;wczas przeglądarka dołącza ciasteczka do żądań tak długo jak są one &ldquo;ważne&rdquo;.</p>
<p>Przykładowy serwlet poniżej w odpowiedzi generuje stronę, kt&oacute;ra wyświetla wszystkie dostępne ciasteczka. Ustawia też jedno ciasteczko o nazwie custom-cookie, jego czas życia ustawiony jest na 10 sekund.</p>
<pre class="lang:default decode:true">@Override<br />
protected void doGet(HttpServletRequest req, HttpServletResponse resp) throws ServletException, IOException {<br />
    PrintWriter responseWriter = resp.getWriter();</p>
<p>    responseWriter.write("<html><body>");<br />
    for (Cookie cookie : req.getCookies()) {<br />
        responseWriter.write("
<p>" + cookie.getName() + " " + cookie.getValue() + "<&#47;p>");<br />
    }</p>
<p>    Cookie cookie = new Cookie("custom-cookie", "bum bum cyk cyk");<br />
    cookie.setMaxAge(10);<br />
    resp.addCookie(cookie);</p>
<p>    responseWriter.write("<&#47;body><&#47;html>");<br />
}<&#47;pre><br />
Przy drugim otworzeniu strony generowanej przez ten serwlet [1. jeśli zrobisz to szybciej niż 10 sekund po pierwszym wywołaniu] zobaczysz ciasteczko custom-cookie</p>
<p>Wcześniej opisane narzędzia developerskie dostępne w przeglądarkach internetowych pozwalają na podejrzenie zawartości ciasteczek.<br />
<a href="http:&#47;&#47;www.samouczekprogramisty.pl&#47;wp-content&#47;uploads&#47;2017&#47;04&#47;cookies.png"><img class="aligncenter size-medium wp-image-820" src="http:&#47;&#47;www.samouczekprogramisty.pl&#47;wp-content&#47;uploads&#47;2017&#47;04&#47;cookies-300x178.png" alt="narzędzia developerskie ciasteczka" width="300" height="178" &#47;><&#47;a></p>
<h2>Zastosowanie ciasteczek<&#47;h2><br />
Jak wiesz z poprzedniego artykułu protok&oacute;ł HTTP jest bezstanowy. Ciasteczka pomagają obejść tę właściwość. Bardzo często ciasteczka wykorzystywane są do zapisania informacji czy użytkownik jest zalogowany w aplikacji. Aplikacja sprawdza czy takie ciasteczko istnieje, jeśli tak udostępnia użytkownikowi jakieś dane. Jeśli ciasteczka brakuje w&oacute;wczas przekierowuje go na stronę logowania.</p>
<p>Po zalogowaniu aplikacja ustawia ciasteczko, kt&oacute;re następnie dołączane jest do kolejnych żądań automatycznie.</p>
<p>Użytkownik ma możliwość ustawienia przeglądarki internetowej w ten spos&oacute;b aby nie zapamiętywała ciasteczek. Nie jest to popularne, ale warto wiedzieć, że jest taka możliwość.</p>
<p>Podobnie jak w przypadku nagł&oacute;wk&oacute;w - w codziennej pracy z aplikacjami webowymi często nie używa się ciasteczek bezpośrednio. Dzieje się to niejako "pod spodem" - zewnętrzne biblioteki wykorzystują ten mechanizm.</p>
<h1>Sesja<&#47;h1><br />
Można powiedzieć, że sesja to połączenie kilku żądań&#47;odpowiedzi w jedną całość. Dzięki temu aplikacja webowa może powiązać te żądania z jednym użytkownikiem. Sesje najczęściej zaimplementowane są przy pomocy ciasteczek. Specyfikacja serwlet&oacute;w określa nawet domyślną nazwę takiego ciasteczka - jest to <code>JSESSIONID<&#47;code>.</p>
<p>Innym mechanizmem, na kt&oacute;rym może być oparta sesja jest przepisywanie adresu URL (ang. <em>URL rewriting<&#47;em>). Polega ono na dołączaniu identyfikatora sesji do adresu. W takim przypadku adres może wyglądać następująco <code>http:&#47;&#47;www.samouczekprogramisty.pl&#47;kurs-programowania-java;jsessionid=1234<&#47;code>. To kontener serwlet&oacute;w decyduje o metodzie, kt&oacute;ra powinna być użyta do &ldquo;podtrzymywania&rdquo; sesji.</p>
<p>Podobnie jak w przypadku ciasteczek sesja ma sw&oacute;j dedykowany obiekt. Po stronie serwera sesja reprezentowana jest przez <a href="https:&#47;&#47;docs.oracle.com&#47;javaee&#47;7&#47;api&#47;javax&#47;servlet&#47;http&#47;HttpSession.html" target="_blank"><code>HttpSession<&#47;code><&#47;a>.</p>
<h2>Czas trwania sesji<&#47;h2><br />
Sesja nie jest trzymana wiecznie. To jak długo powinna być utrzymywana przez kontener serwlet&oacute;w określone jest przez parametr metody <a href="https:&#47;&#47;docs.oracle.com&#47;javaee&#47;7&#47;api&#47;javax&#47;servlet&#47;http&#47;HttpSession.html#setMaxInactiveInterval-int-" target="_blank"><code>setMaxInactiveInterval<&#47;code><&#47;a>. Określa on w sekundach jak długo pomiędzy żądaniami klienta sesjsa powinna być utrzymywana.</p>
<h2>Atrybuty sesji<&#47;h2><br />
Sesję można por&oacute;wnać do mapy, w kt&oacute;rej przechowujemy pary klucz-wartość. Są to atrybuty sesji. Dzięki nim mamy możliwość przekazywania informacji wewnątrz aplikacji webowej pomiędzy żądaniami klienta. Poniższy zestaw metod pozwala na pracę z atrybutami sesji:</p>
<ul>
<li><a href="https:&#47;&#47;docs.oracle.com&#47;javaee&#47;7&#47;api&#47;javax&#47;servlet&#47;http&#47;HttpSession.html#getAttributeNames--" target="_blank"><code>getAttributeNames()<&#47;code><&#47;a><&#47;li>
<li><a href="https:&#47;&#47;docs.oracle.com&#47;javaee&#47;7&#47;api&#47;javax&#47;servlet&#47;http&#47;HttpSession.html#getAttribute-java.lang.String-" target="_blank"><code>getAttribute()<&#47;code><&#47;a><&#47;li>
<li><a href="https:&#47;&#47;docs.oracle.com&#47;javaee&#47;7&#47;api&#47;javax&#47;servlet&#47;http&#47;HttpSession.html#removeAttribute-java.lang.String-" target="_blank">removeAttribute()<code><&#47;code><&#47;a><&#47;li>
<li><a href="https:&#47;&#47;docs.oracle.com&#47;javaee&#47;7&#47;api&#47;javax&#47;servlet&#47;http&#47;HttpSession.html#setAttribute-java.lang.String-java.lang.Object-" target="_blank">setAttribute()<code><&#47;code><&#47;a><&#47;li><br />
<&#47;ul><br />
Wartościami atrybut&oacute;w są obiekty, jednak musisz pamiętać o tym aby nie były one &ldquo;duże&rdquo;. Atrybuty sesji powinny być także serializowalne. Jeśli nie miałeś do czynienia z serializacją zapraszam do artykułu poświęconemu <a href="http:&#47;&#47;www.samouczekprogramisty.pl&#47;serializacja-w-jezyku-java&#47;">serializacji w języku Java<&#47;a>.</p>
<h2>Mechanizm przechowywania sesji<&#47;h2><br />
Sesje mogą być przechowywane w pamięci kontenera serwlet&oacute;w. Nie jest to jedyna metoda ich przechowywania. Naiwny mechanizm może być oparty o ciasteczka, w takim przypadku wszystkie atrybuty sesji byłyby ciasteczkami.</p>
<p>Kontener serwlet&oacute;w do zapisywania sesji może użyć standardowych plik&oacute;w. Sesja może być także zapisana w r&oacute;żnych bazach danych. To w jaki spos&oacute;b będzie to realizowane zależy od konfiguracji kontenera serwlet&oacute;w. W podstawowych przypadkach nie musisz się przejmować tą konfiguracją.</p>
<pre class="lang:default decode:true">@WebServlet("&#47;session")<br />
public class SessionServlet extends HttpServlet {</p>
<p>    public static final String VISIT_COUNTER_ATTR = "visitCounter";</p>
<p>    @Override<br />
    protected void doGet(HttpServletRequest req, HttpServletResponse resp) throws ServletException, IOException {<br />
        PrintWriter responseWriter = resp.getWriter();</p>
<p>        responseWriter.write("<html><body>");</p>
<p>        HttpSession session = req.getSession();<br />
        Enumeration<String> attributeNames = session.getAttributeNames();<br />
        while (attributeNames.hasMoreElements()) {<br />
            String attributeName = attributeNames.nextElement();<br />
            responseWriter.write("
<p>" + attributeName + ": " + session.getAttribute(attributeName) + "<&#47;p>");<br />
        }<br />
        responseWriter.write("<&#47;body><&#47;html>");<br />
        increaseVisitCounter(session);<br />
    }</p>
<p>    private void increaseVisitCounter(HttpSession session) {<br />
        Object counter = session.getAttribute(VISIT_COUNTER_ATTR);<br />
        Integer numberOfVisits;<br />
        if (counter != null) {<br />
            numberOfVisits = (Integer) counter + 1;<br />
        }<br />
        else {<br />
            numberOfVisits = 1;<br />
        }<br />
        session.setAttribute(VISIT_COUNTER_ATTR, numberOfVisits);<br />
    }<br />
}<&#47;pre></p>
<h1>Ćwiczenie do wykonania<&#47;h1><br />
Napisz serwlet, kt&oacute;ry pobierze wartość wszystkich parametr&oacute;w przekazanych w adresie. Pobierze wszystkie parametry, kt&oacute;rych wartości są liczbami całkowitymi, następnie sumę tych parametr&oacute;w wyświetli na ekranie. Serwlet ten powinien dodatkowo w sesji zapamiętać sumaryczną wartość wszystkich takich operacji. Ta całkowita suma także powinna być wyświetlona</p>
<p>Na przykład, pierwsze żądanie pod adres <code>&#47;serwlet?parametr=123&amp;inny-parametr=abc&amp;test=-3<&#47;code> powinno wyświetlić stronę:</p>
<pre class="lang:default highlight:0 decode:true">requestSum: 120<br />
totalSum: 120<&#47;pre><br />
Kolejne żądanie pod adres <code>&#47;serwlet?parametr=336<&#47;code> powinno wyświetlić stornę</p>
<pre class="lang:default highlight:0 decode:true ">requestSum: 336<br />
totalSum: 456<&#47;pre><br />
W przypadku jakichkolwiek problem&oacute;w z wykonaniem ćwiczenia możesz rzucić okiem na <a href="https:&#47;&#47;github.com&#47;SamouczekProgramisty&#47;KursAplikacjeWebowe&#47;blob&#47;master&#47;02_serwlety&#47;src&#47;main&#47;java&#47;pl&#47;samouczekprogramisy&#47;kursaplikacjewebowe&#47;servlets&#47;exercise&#47;ExerciseServlet.java" target="_blank">przykładowe rozwiązanie<&#47;a>.</p>
<h1>Dodatkowe materiały do nauki<&#47;h1></p>
<ul>
<li><a href="https:&#47;&#47;en.wikipedia.org&#47;wiki&#47;HTTP_cookie" target="_blank">Artykuł na wikipedi na temat ciasteczek<&#47;a>,<&#47;li>
<li><a href="https:&#47;&#47;en.wikipedia.org&#47;wiki&#47;List_of_HTTP_header_fields" target="_blank">Lista standardowych nagł&oacute;wk&oacute;w HTTP<&#47;a>,<&#47;li>
<li><a href="http:&#47;&#47;download.oracle.com&#47;otndocs&#47;jcp&#47;servlet-3_1-fr-eval-spec&#47;index.html" target="_blank">Specyfikacja serwlet&oacute;w<&#47;a>,<&#47;li>
<li><a href="http:&#47;&#47;www.ietf.org&#47;rfc&#47;rfc2616.txt" target="_blank">Specyfikacja protokołu HTTP&#47;1.1<&#47;a>,<&#47;li>
<li><a href="https:&#47;&#47;github.com&#47;SamouczekProgramisty&#47;KursAplikacjeWebowe&#47;tree&#47;master&#47;02_serwlety&#47;src&#47;main&#47;java&#47;pl&#47;samouczekprogramisy&#47;kursaplikacjewebowe&#47;servlets" target="_blank">Kod źr&oacute;dłowy przykład&oacute;w użytych w artykule<&#47;a>.<&#47;li><br />
<&#47;ul></p>
<h1>Podsumowanie<&#47;h1><br />
Po lekturze tego artykułu znasz już zestaw podstawowych klock&oacute;w, z kt&oacute;rych buduje się aplikacje webowe. Wiesz już czym są parametry adresu URL i jak z nimi pracować. Znasz mechanizm nagł&oacute;wk&oacute;w. Potrafisz powiedzieć czym jest ciasteczko i sesja. Po wykonaniu ćwiczenia znasz te zagadnienia także od praktycznej strony. Innymi słowy kawał wiedzy ;).</p>
<p>Na koniec mam do Ciebie prośbę. Zależy mi na dotarciu do jak największego grona Samouk&oacute;w takich jak Ty. Podziel się proszę linkiem do artykułu ze swoimi znajomymi. Mam nadzieję, że im także spodoba się artykuł.</p>
<p>Jeśli nie chcesz ominąć kolejnych artykuł&oacute;w dopisz się do samouczkowego newslettera i polub stronę na facebooku. Do następnego razu!</p>
<p>[FM_form id="3"]</p>
<p>Zdjęcie dzięki uprzejmości https:&#47;&#47;www.flickr.com&#47;photos&#47;nitot&#47;6124595416&#47;sizes&#47;l</p>
