---
layout: post
status: publish
published: true
title: Deskryptor wdrożenia w aplikacjach webowych
author:
  display_name: Marcin Pietraszek
  login: marcin
  email: m.pietraszek@gmail.com
  url: ''
author_login: marcin
author_email: m.pietraszek@gmail.com
excerpt: "Do tej pory w konfigurowaniu wszystkich element&oacute;w aplikacji webowej
  posługiwałem się adnotacjami. Nadszedł czas abyś poznał inny spos&oacute;b konfiguracji
  aplikacji webowych. Konfiguracja przy pomocy pliku <code>web.xml<&#47;code> nazywanego
  deskryptorem wdrożenia.\r\n\r\n"
wordpress_id: 876
wordpress_url: http://www.samouczekprogramisty.pl/?p=876
date: '2017-04-27 21:56:57 +0200'
date_gmt: '2017-04-27 19:56:57 +0200'
categories:
- DSP2017
- Kurs aplikacji webowych
tags: []
comments: []
---
<p>Do tej pory w konfigurowaniu wszystkich element&oacute;w aplikacji webowej posługiwałem się adnotacjami. Nadszedł czas abyś poznał inny spos&oacute;b konfiguracji aplikacji webowych. Konfiguracja przy pomocy pliku <code>web.xml<&#47;code> nazywanego deskryptorem wdrożenia.</p>
<p><a id="more"></a><a id="more-876"></a></p>
<h1>Deskryptor wdrożenia<&#47;h1><br />
Plik <code>web.xml<&#47;code> nazywany jest deskryptorem wdrożenia. W starszych wersjach specyfikacji serwlet&oacute;w tylko przy jego pomocy można było konfigurować aplikacje webowe.</p>
<p>Aktualnie plik <code>web.xml<&#47;code> nie jest wymagany, praktycznie wszystkie elementy można skonfigurować przy pomocy adnotacji. Jednak nadal zdarzają się aplikacje gdzie taki plik jest wykorzystywany. W związku z tym dobrze jest wiedzieć o jego istnieniu.</p>
<p>Oczywiście zawartością deskryptora wdrożenia są znaczniki XML, jeśli nie miałeś wcześniej styczności z tym formatem zapraszam do osobnego artykułu ze <a href="http:&#47;&#47;www.samouczekprogramisty.pl&#47;xml-dla-poczatkujacych&#47;">wstępem do formatu XML<&#47;a>.</p>
<p>Plik <code>web.xml<&#47;code> powinien znajdować się bezpośrednio w katalogu WEB-INF wewnątrz pliku war. Struktura przykładowego pliku war może wyglądać następująco:</p>
<pre class="lang:default highlight:0 decode:true ">$ unzip -l build&#47;libs&#47;05_webxml-1.0-SNAPSHOT.war<br />
Archive:  build&#47;libs&#47;05_webxml-1.0-SNAPSHOT.war<br />
  Length      Date    Time    Name<br />
---------  ---------- -----   ----<br />
        0  2017-04-27 20:15   META-INF&#47;<br />
       25  2017-04-27 20:12   META-INF&#47;MANIFEST.MF<br />
        0  2017-04-27 20:15   WEB-INF&#47;<br />
        0  2017-04-27 20:15   WEB-INF&#47;classes&#47;<br />
        0  2017-04-26 21:36   WEB-INF&#47;classes&#47;pl&#47;<br />
        0  2017-04-26 21:36   WEB-INF&#47;classes&#47;pl&#47;samouczekprogramisty&#47;<br />
        0  2017-04-26 21:36   WEB-INF&#47;classes&#47;pl&#47;samouczekprogramisty&#47;kursaplikacjewebowe&#47;<br />
        0  2017-04-27 20:15   WEB-INF&#47;classes&#47;pl&#47;samouczekprogramisty&#47;kursaplikacjewebowe&#47;webxml&#47;<br />
        0  2017-04-27 20:15   WEB-INF&#47;classes&#47;pl&#47;samouczekprogramisty&#47;kursaplikacjewebowe&#47;webxml&#47;xml&#47;<br />
     1073  2017-04-27 20:15   WEB-INF&#47;classes&#47;pl&#47;samouczekprogramisty&#47;kursaplikacjewebowe&#47;webxml&#47;xml&#47;XMLConfiguredListener.class<br />
     3045  2017-04-27 20:15   WEB-INF&#47;classes&#47;pl&#47;samouczekprogramisty&#47;kursaplikacjewebowe&#47;webxml&#47;xml&#47;XMLConfiguredServlet.class<br />
     1330  2017-04-27 20:15   WEB-INF&#47;classes&#47;pl&#47;samouczekprogramisty&#47;kursaplikacjewebowe&#47;webxml&#47;xml&#47;XMLConfiguredFilter.class<br />
     1227  2017-04-26 21:40   WEB-INF&#47;web.xml<br />
---------                     -------<br />
     6700                     13 files<br />
<&#47;pre><br />
Strukturę aplikacji webowej opisywałem szczeg&oacute;łowo w pierwszym <a href="http:&#47;&#47;www.samouczekprogramisty.pl&#47;serwlety-w-aplikacjach-webowych&#47;">artykule wprowadzającym<&#47;a>.</p>
<h1>Szablon <code>web.xml<&#47;code><&#47;h1><br />
Plik <code>web.xml<&#47;code> informuje kontener serwlet&oacute;w o wersji specyfikacji serwlet&oacute;w. Dla każdej wersji specyfikacji plik ten r&oacute;żni się nagł&oacute;wkiem. Dla wersji 3.1 szablon pliku wygląda następująco</p>
<pre class="lang:default highlight:0 decode:true "><web-app xmlns="http:&#47;&#47;xmlns.jcp.org&#47;xml&#47;ns&#47;javaee"<br />
         xmlns:xsi="http:&#47;&#47;www.w3.org&#47;2001&#47;XMLSchema-instance"<br />
         xsi:schemaLocation="http:&#47;&#47;xmlns.jcp.org&#47;xml&#47;ns&#47;javaee<br />
         http:&#47;&#47;xmlns.jcp.org&#47;xml&#47;ns&#47;javaee&#47;web-app_3_1.xsd"<br />
         version="3.1"><br />
    <!-- tutaj są znaczniki do konfiguracji --><br />
<&#47;web-app><&#47;pre><br />
Jak widzisz w gł&oacute;wnym węzłem deskryptora wdrożenia jest <code><web-app><&#47;code>. Wewnątrz tego znacznika znajduje się właściwe elementy konfigurujące aplikację webową.</p>
<p>W kolejnej części artykułu zobaczysz por&oacute;wnanie konfiguracji przy pomocy znacznik&oacute;w XML z konfiguracją zapisaną w postaci adnotacji. W obu przypadkach pokazywał będę prostą aplikację, kt&oacute;ra zawiera serwlet, obiekt nasłuchujący i filtr. Przykładowy deskryptor wdrożenia możesz zobaczyć na <a href="https:&#47;&#47;github.com&#47;SamouczekProgramisty&#47;KursAplikacjeWebowe&#47;blob&#47;master&#47;05_webxml&#47;src&#47;main&#47;webapp&#47;WEB-INF&#47;web.xml" target="_blank" rel="noopener noreferrer">samouczkowym githubie<&#47;a>. Zawiera on wszystkie elementy om&oacute;wione poniżej.</p>
<h2>Konfiguracja serwletu<&#47;h2><br />
Podstawowa konfiguracja serwletu sprowadza się do nadania mu nazwy i podpięcia go pod odpowiedni adres URL. Zobacz jak taki efekt można osiągnąć przy pomocy znacznik&oacute;w XML i adnotacji.</p>
<h3>Znaczniki XML<&#47;h3></p>
<pre class="lang:default highlight:0 decode:true"><servlet><br />
    <servlet-name>my-servlet<&#47;servlet-name><br />
    <servlet-class>pl.samouczekprogramisty.kursaplikacjewebowe.webxml.xml.XMLConfiguredServlet<&#47;servlet-class><br />
<&#47;servlet></p>
<p><servlet-mapping><br />
    <servlet-name>my-servlet<&#47;servlet-name><br />
    <url-pattern>&#47;servlet-url-xml<&#47;url-pattern><br />
<&#47;servlet-mapping><&#47;pre><br />
Powyższy fragment xml zawiera kilka znacznik&oacute;w. Pierwszy z nich <code><servlet><&#47;code> informuje kontener serwlet&oacute;w o tym, ze w klasie <code>pl.samouczekprogramisty.kursaplikacjewebowe.webxml.xml.XMLConfiguredServlet<&#47;code> znajduje się serwlet. Nadałem mu nazwę <code>my-servlet<&#47;code>. Następnie wewnątrz <code><servlet-mapping><&#47;code>, posługując się wcześniej nadaną nazwą podpinam serwlet pod adres URL <code>&#47;servlet-url-xml<&#47;code>.</p>
<h3>Adnotacje<&#47;h3></p>
<pre class="lang:default decode:true">@WebServlet(name = "my-servlet", urlPatterns = "&#47;servlet-url-annotations")<br />
public class AnnotationConfiguredServlet extends HttpServlet<&#47;pre><br />
W przypadku adnotacji sprawa jest prostsza. Tutaj nie muszę podawać dokładnej nazwy klasy wraz z pakietem. Adnotacja znajduje się właśnie w nad tą klasą.</p>
<h2>Konfiguracja filtra<&#47;h2><br />
Aby skonfigurować podstawowy filtr należy nadać mu nazwę i podpiąć go pod serwlet czy adres URL. Poniżej możesz por&oacute;wnać oba sposoby konfiguracji.</p>
<h3>Znaczniki XML<&#47;h3></p>
<pre class="lang:default highlight:0 decode:true "><filter><br />
    <filter-name>my-filter<&#47;filter-name><br />
    <filter-class>pl.samouczekprogramisty.kursaplikacjewebowe.webxml.xml.XMLConfiguredFilter<&#47;filter-class><br />
<&#47;filter></p>
<p><filter-mapping><br />
    <filter-name>my-filter<&#47;filter-name><br />
    <url-pattern>&#47;servlet-url-xml<&#47;url-pattern><br />
<&#47;filter-mapping></p>
<p><filter-mapping><br />
    <filter-name>my-filter<&#47;filter-name><br />
    <servlet-name>my-servlet<&#47;servlet-name><br />
<&#47;filter-mapping><&#47;pre><br />
Podobnie jak w przypadku serwletu pierwszy znacznik <code><filter><&#47;code> tworzy filtr o nazwie <code>my-filter<&#47;code> podpinając klasę <code>pl.samouczekprogramisty.kursaplikacjewebowe.webxml.xml.XMLConfiguredFilte<&#47;code>. Kolejne dwie grupy znacznik&oacute;w <code><filter-mapping><&#47;code> posługują się nazwą filtra. Pierwsza używa <code><url-pattern><&#47;code> aby podpiąć filtr pod konkretny adres URL. Wewnątrz drugiego znacznika <code><filter-mapping><&#47;code> użyłem <code><servlet-name><&#47;code> aby podpiąć filtr pod konkretny serwlet.</p>
<h3>Adnotacje<&#47;h3></p>
<pre class="lang:default decode:true ">@WebFilter(filterName = "my-filter", servletNames = "my-servlet", urlPatterns = "&#47;servlet-url-annotations")<br />
public class AnnotationConfiguredFilter implements Filter<&#47;pre></p>
<h2>Konfiguracja obiektu nasłuchującego<&#47;h2><br />
W tym przypadku sprawa jest prosta. Cała konfiguracja sprowadza się do poinformowania kontenera serwlet&oacute;w o istnieniu takiego obiektu.</p>
<h3>Znacznik XML<&#47;h3></p>
<pre class="lang:default highlight:0 decode:true ">
<listener>
<listener-class>pl.samouczekprogramisty.kursaplikacjewebowe.webxml.xml.XMLConfiguredListener<&#47;listener-class><br />
<&#47;listener><&#47;pre></p>
<h3>Adnotacje<&#47;h3></p>
<pre class="lang:default decode:true ">@WebListener<br />
public class AnnotationConfiguredListener implements ServletRequestListener<&#47;pre></p>
<h1>Dodatkowe informacje<&#47;h1></p>
<h2>Kiedy plik web.xml jest niezbędny<&#47;h2><br />
Są sytuacje w kt&oacute;rych plik web.xml jest niezbędny. W przypadku kiedy istotna jest kolejność wykonania filtr&oacute;w, obiekt&oacute;w nasłuchujących czy przypisania serwlet&oacute;w do adres&oacute;w URL plik web.xml jest niezbędny. Specyfikacja serwlet&oacute;w jasno m&oacute;wi o tym, że bez tego pliku kolejność wywołania tych element&oacute;w nie jest jasno określona.</p>
<h2>Modułowość konfiguracji<&#47;h2><br />
Konfigurację podobną do tej z pliku <code>web.xml<&#47;code> można zawrzeć w plikach <code>web-fragment.xml<&#47;code>. Taki plik może znajdować się w każdym pliku jar, kt&oacute;ry znajduje się wewnątrz pliku war (ponownie odsyłam do <a href="http:&#47;&#47;www.samouczekprogramisty.pl&#47;serwlety-w-aplikacjach-webowych&#47;">artykułu opisującego strukturę aplikacji webowej<&#47;a>). Konkretnie w katalogu <code>META-INF<&#47;code> wewnątrz pliku jar.</p>
<p>Wewnątrz pliku <code>web-fragment.xml<&#47;code> możemy użyć tych samych znacznik&oacute;w jak pliku <code>web.xml<&#47;code>. R&oacute;żnicą jest tutaj znacznik gł&oacute;wny. W tym przypadku jest to <code><web-fragment><&#47;code> a nie <code><web-app><&#47;code>.</p>
<h2>Ostatnie słowo ma <code>web.xml<&#47;code><&#47;h2><br />
Chociaż dla niekt&oacute;rych os&oacute;b adnotacje czy pliki <code>web-fragment.xml<&#47;code> mogą być preferowanym wyborem to <code>web.xml<&#47;code> ma ostatnie słowo. Mam tu na myśli atrybut <code>metadat-complete<&#47;code>. Atrybut ten można ustawić na znaczniku <code><web-app><&#47;code>. Jeśli przyjmie on wartość <code>true<&#47;code>, w&oacute;wczas adnotacje i pliki <code>web-fragment.xml<&#47;code> będą ignorowane. W takim przypadku cała konfiguracja aplikacji webowej musi znajdować się w pliku <code>web.xml<&#47;code>.</p>
<pre class="lang:default highlight:0 decode:true "><web-app xmlns="http:&#47;&#47;xmlns.jcp.org&#47;xml&#47;ns&#47;javaee"<br />
         xmlns:xsi="http:&#47;&#47;www.w3.org&#47;2001&#47;XMLSchema-instance"<br />
         xsi:schemaLocation="http:&#47;&#47;xmlns.jcp.org&#47;xml&#47;ns&#47;javaee<br />
         http:&#47;&#47;xmlns.jcp.org&#47;xml&#47;ns&#47;javaee&#47;web-app_3_1.xsd"<br />
         version="3.1"<br />
         metadata-complete=&rdquo;true&rdquo;></p>
<p>    <!-- tutaj są znaczniki do konfiguracji --></p>
<p><&#47;web-app><&#47;pre></p>
<h1>Przykładowe aplikacje<&#47;h1><br />
Na potrzeby tego artykułu napisałem dwie proste aplikacje. Jedna z nich skonfigurowana jest wyłączni przy użyciu znacznik&oacute;w xml, druga tylko adnotacji. Zachęcam do zajrzenia do kodu, kt&oacute;ry umieściłem na githubie:</p>
<ul>
<li><a href="https:&#47;&#47;github.com&#47;SamouczekProgramisty&#47;KursAplikacjeWebowe&#47;tree&#47;master&#47;05_webxml&#47;src&#47;main" target="_blank" rel="noopener noreferrer">Aplikacja konfigurowana wyłącznie przy pomocy XML<&#47;a>,<&#47;li>
<li><a href="https:&#47;&#47;github.com&#47;SamouczekProgramisty&#47;KursAplikacjeWebowe&#47;tree&#47;master&#47;05_webxml_annotations&#47;src&#47;main&#47;" target="_blank" rel="noopener noreferrer">Aplikacja konfigurowana wyłącznie przy pomocy adnotacji<&#47;a>.<&#47;li><br />
<&#47;ul></p>
<h1>Podsumowanie<&#47;h1><br />
Przedstawiłem tutaj wyłącznie podstawowe znaczniki stosowane wewnątrz pliku <code>web.xml<&#47;code>. Zależało mi na tym abyś sam m&oacute;gł zobaczyć r&oacute;żnicę pomiędzy tymi podejściami. Nie oceniam, kt&oacute;re z nich jest lepsze, kt&oacute;re gorsze. Każde z nich ma swoje wady i zalety. Wybierz ten spos&oacute;b, kt&oacute;ry bardziej Ci odpowiada i konsekwentnie się go trzymaj.</p>
<p>Z jednej strony posiadanie całej konfiguracji w pliku xml jest wygodne. Jednak z drugiej strony w przypadku adnotacji edytując kod od razu masz informacje o konfiguracji. Ciekawy jestem Twojego zdania. Kt&oacute;re podejście bardziej Ci odpowiada i dlaczego?</p>
<p>[FM_form id="3"]</p>
<p>Zdjęcie dzięki uprzejmości https:&#47;&#47;www.flickr.com&#47;photos&#47;photos_by_clark&#47;26137047996&#47;sizes&#47;l</p>
